# St7GetNumGeometryLoopEdges

Returns the number of edges in the specified loop.

long St7GetNumGeometryLoopEdges(long uID, long LoopNum, long* NumEdges)

Input Parameters

uID

Strand7 model file ID.

LoopNum

Loop number.

Output Parameters
NumEdges

Number of edges in the loop.